const mapData = [
  null, // 反對逃犯條例修訂草案事件簿
  {
    // 香港
    point: [114.151, 22.408],
    scale: 1
  },
  {
    // 2019/06/09 14:30 103萬人
    point: [114.1904, 22.2611],
    scale: 7
  },
  {
    // 14:20 出發
    point: [114.18905, 22.2821],
    scale: 20,
    march: ["0609 遊行路線"],
    time: 1560061200
  },
  {
    // image 01
    point: [114.17905, 22.2821],
    scale: 20,
    march: ["0609 遊行路線"],
    time: 1560063000
  },
  {
    // 15:55 抵達
    point: [114.16682, 22.28096],
    scale: 20,
    march: ["0609 遊行路線", "0609 電廠道"],
    time: 1560066900
  },
  {
    // 17:00 龍尾
    point: [114.19568, 22.28999],
    scale: 20,
    march: ["0609 遊行路線", "0609 電廠道"],
    time: 1560070800
  },
  {
    // 19:00 img 02
    point: [114.16711, 22.28212],
    scale: 20,
    march: ["0609 遊行路線"],
    time: 1560078000,
    circle: 40
  },
  {
    // 21:00 img 03
    point: [114.16543, 22.27979],
    scale: 20,
    march: ["0609 遊行路線"],
    time: 1560085200,
    circle: 30
  },
  {
    // 22:00 結束
    point: [114.16543, 22.27979],
    scale: 20,
    circle: 30
  },

  {
    // 2019/06/12 群眾佔領行動
    point: [114.16681, 22.2811],
    scale: 20
  },
  {
    // 07:55 龍和道 夏慤道
    point: [114.16681, 22.2811],
    scale: 30,
    march: ["0612 佔領1", "0612 佔領2"]
  },
  {
    // 12:00 img 01
    point: [114.16681, 22.2811],
    scale: 30,
    march: ["0612 佔領1", "0612 佔領2"]
  },
  {
    // 16:00 img 02
    point: [114.16681, 22.2811],
    scale: 30,
    march: ["0612 佔領1", "0612 佔領2"]
  },
  {
    // 20:00 img 03
    point: [114.15862, 22.28274],
    scale: 30,
    march: ["0612 佔領1", "0612 佔領2"],
    circle: 30
  },
  {
    // 01:00 散去
    point: [114.15862, 22.28274],
    scale: 30,
    circle: 3
  },

  {
    // 過場
    point: [114.1904, 22.2611],
    scale: 7
  },
  {
    // 2019/06/16 14:30 200萬人
    point: [114.1904, 22.2611],
    scale: 7
  },
  {
    // 五大訴求
    point: [114.1904, 22.2611],
    scale: 7
  },
  {
    // 14:00 出發前 img 01
    point: [114.18905, 22.2821],
    scale: 20,
    circle: 30
  },
  {
    // 14:43 出發
    point: [114.18905, 22.2821],
    scale: 20,
    march: ["0616 遊行路線", "0616 波士富街"],
    time: 1560667320
  },
  {
    // 14:50 波士富街
    point: [114.18905, 22.2821],
    scale: 20,
    march: ["0616 遊行路線", "0616 波士富街"],
    time: 1560667800
  },
  {
    // 15:09 銅鑼灣 img 02
    point: [114.18322, 22.27998],
    scale: 20,
    march: ["0616 遊行路線", "0616 波士富街"],
    circle: 5,
    time: 1560668940
  },
  {
    // 15:36 警察總部 img 03
    point: [114.17043, 22.27757],
    scale: 20,
    march: ["0616 遊行路線", "0616 波士富街", "0616 駱克道"],
    circle: 5,
    time: 1560670560
  },
  {
    // 16:05 終點
    point: [114.16682, 22.28096],
    scale: 20,
    march: ["0616 遊行路線", "0616 波士富街", "0616 駱克道"],
    time: 1560672300,
    circle: 30
  },
  {
    // 16:02 駱克道 時間 16:19
    point: [114.18492, 22.28031],
    scale: 20,
    march: ["0616 遊行路線", "0616 波士富街", "0616 駱克道"],
    time: 1560673140
  },
  {
    // 16:22 告士打道
    point: [114.1746, 22.27933],
    scale: 20,
    march: ["0616 遊行路線", "0616 波士富街", "0616 駱克道", "0616 吿士打道"],
    time: 1560673320
  },
  {
    // 16:38 謝斐道
    point: [114.1746, 22.27933],
    scale: 20,
    march: [
      "0616 遊行路線",
      "0616 波士富街",
      "0616 駱克道",
      "0616 吿士打道",
      "0616 謝斐道"
    ],
    time: 1560674280
  },
  {
    // 17:30 莊士敦道
    point: [114.1746, 22.27933],
    scale: 20,
    march: [
      "0616 遊行路線",
      "0616 波士富街",
      "0616 駱克道",
      "0616 吿士打道",
      "0616 謝斐道",
      "0616 莊士敦道"
    ],
    time: 1560677400
  },
  {
    // 18:40 img 04
    point: [114.16642, 22.27949],
    scale: 20,
    march: [
      "0616 遊行路線",
      "0616 波士富街",
      "0616 駱克道",
      "0616 吿士打道",
      "0616 謝斐道",
      "0616 莊士敦道"
    ],
    time: 1560681600,
    circle: 5
  },
  {
    // 20:06 img 05
    point: [114.16666, 22.27802],
    scale: 20,
    march: [
      "0616 遊行路線",
      "0616 波士富街",
      "0616 駱克道",
      "0616 吿士打道",
      "0616 謝斐道",
      "0616 莊士敦道"
    ],
    time: 1560686760,
    circle: 5
  },
  {
    // 21:48 img 06
    point: [114.16666, 22.27802],
    scale: 20,
    march: [
      "0616 遊行路線",
      "0616 波士富街",
      "0616 駱克道",
      "0616 吿士打道",
      "0616 謝斐道",
      "0616 莊士敦道"
    ],
    time: 1560692880
  },
  {
    // 02:00 散場
    point: [114.1904, 22.2611],
    scale: 7
  }
];

export default mapData;
