const mapData = [
  null, // 反對逃犯條例修訂草案事件簿
  { // 香港
    point: [114.151, 22.408],
    scale: 1,
  },
  { // 2019/06/09 14:30 103萬人
    point: [114.1904, 22.2611],
    scale: 7,
  },
  { // 14:20 出發
    point: [114.18905, 22.28210],
    scale: 20,
    march: ['0609 遊行路線'],
    time: 1560061200,
  },
  { // image 01
    point: [114.17905, 22.28210],
    scale: 20,
    march: ['0609 遊行路線'],
    time: 1560063000,
  },
  { // 15:55 抵達
    point: [114.16682, 22.28096],
    scale: 20,
    march: ['0609 遊行路線', '0609 電廠道'],
    time: 1560066900,
  },
  { // 17:00 龍尾
    point: [114.19568, 22.28999],
    scale: 20,
    march: ['0609 遊行路線', '0609 電廠道'],
    time: 1560070800,
  },
  { // 19:00 img 02
    point: [114.16711, 22.28212],
    scale: 20,
    march: ['0609 遊行路線'],
    time: 1560078000,
  },
  { // 21:00 img 03
    point: [114.16711, 22.28212],
    scale: 20,
    march: ['0609 遊行路線'],
    time: 1560085200,
  },

  { // 2019/06/12 群眾佔領行動
    point: [114.16681, 22.28110],
    scale: 20,
  },
  { // 07:55 龍和道 夏慤道
    point: [114.16681, 22.28110],
    scale: 30,
    march: ['0612 佔領1', '0612 佔領2'],
  },
  { // 12:00 img 01
    point: [114.16681, 22.28110],
    scale: 30,
    march: ['0612 佔領1', '0612 佔領2'],
  },
  { // 16:20 img 02
    point: [114.16681, 22.28110],
    scale: 30,
    march: ['0612 佔領1', '0612 佔領2'],
  },
  { // 20:00 img 03
    point: [114.15862, 22.28274],
    scale: 30,
    march: ['0612 佔領1', '0612 佔領2'],
    circle: 30,
  },
  { // 20:00 img 03
    point: [114.15862, 22.28274],
    scale: 30,
    march: ['0612 佔領1', '0612 佔領2'],
    circle: 30,
  },

  { // 2019/06/12 14:30 200萬人
    point: [114.1904, 22.2611],
    scale: 7,
  },
];

export default mapData;
